{
  "educationData": {
    "label": "educationdata",
    "data": [
      {
        "degree": "Web Development Bootcamp",
        "name": "Ironhack",
        "duration": "2020",
        "tasks": [
          {
            "description": ""
          },
          {
            "description": ""
          },
          {
            "description": ""
          }
        ]
      },
      {
        "degree": "MSc in Material Science",
        "name": "University Jena",
        "duration": "2014 - 2017",
        "tasks": [
          {
            "description": ""
          },
          {
            "description": ""
          },
          {
            "description": ""
          }
        ]
      },
      {
        "degree": "BEng in Industrial Engineering",
        "name": "University of Applied Sciences Trier",
        "duration": "2009 - 2013",
        "tasks": [
          {
            "description": ""
          },
          {
            "description": ""
          },
          {
            "description": ""
          }
        ]
      }
    ]
  },
  "jobsData": {
    "label": "jobsdata",
    "data": [
      {
        "title": "Product Manager, Beta Systems IAM Software AG",
        "tenure": "10/2023 - now",
        "description": "Drove strategic development and management of the enterprise-grade Identity and Access Management (IAM) product suite 'Garancy', delivering innovative solutions and operational efficiencies for global organizations.",
        "tasks": [
          {
            "keyword": "Agile Product Ownership",
            "description": "Managed the full product lifecycle for a suite of IAM solutions, including web-based client interfaces, analytics platforms, workflow automation tools, and service offerings, ensuring scalable, user-focused outcomes."
          },
          {
            "keyword": "Strategic Leadership",
            "description": "Partnered with a 7-member leadership team to craft and execute the product strategy, mission, and vision for a rebranded IAM portfolio, aligning with enterprise security and compliance needs."
          },
          {
            "keyword": "Project Leadership",
            "description": "Directed cross-functional teams to launch advanced IAM features, such as role-based access modeling, automated testing frameworks, and identity provider integrations, achieving on-time delivery and strong market adoption."
          },
          {
            "keyword": "Process Optimization",
            "description": "Implemented automation and process improvements across QA, support, documentation, and development teams, leveraging containerized deployments and vulnerability management tools."
          },
          {
            "keyword": "Stakeholder Management",
            "description": "Built and nurtured relationships with customers, partners, and analysts through compelling presentations, demos, and workshops, driving brand recognition and securing strategic partnerships."
          },
          {
            "keyword": "Innovation & Research",
            "description": "Led prototyping and research in AI-driven automation and third-party integrations, enhancing product functionality and maintaining a competitive edge."
          }
        ],
        "techstack": [
          "Docker",
          "Gitlab CI",
          "Node.js",
          "Python",
          "Cursor",
          "Claude",
          "ChatGPT",
          "Cypress",
          "Playwright",
          "Angular",
          "Next.js",
          "Keycloak"
        ]
      },
      {
        "title": "Software Engineer, Beta Systems DCI Software AG",
        "tenure": "9/2022 - 10/2023",
        "description": "Developed and enhanced 'Beta Admin,' an enterprise solution for document archiving, output management, and log management, delivering robust software components and streamlined processes in a collaborative, agile environment.",
        "tasks": [
          {
            "keyword": "Frontend Development",
            "description": "Designed and integrated responsive software components and APIs using React.js, Redux, Bootstrap, HTML5, and CSS3, enhancing user experience and functionality within an agile product team."
          },
          {
            "keyword": "Agile Execution",
            "description": "Executed product roadmap through bi-weekly sprints (versions 5.2.0 to current), implementing user stories and resolving bugs to ensure timely delivery of high-quality releases."
          },
          {
            "keyword": "Codebase Modernization",
            "description": "Refactored legacy code following Clean Code principles, improving maintainability, readability, and performance of the 'Beta Admin' platform."
          },
          {
            "keyword": "Testing Infrastructure",
            "description": "Established comprehensive unit testing (Jest) and cross-platform acceptance testing (VirtualBox) frameworks, increasing code reliability and reducing post-release defects."
          },
          {
            "keyword": "CI/CD Optimization",
            "description": "Configured and optimized Jenkins pipelines to support efficient CI/CD workflows, accelerating development and production deployment cycles."
          }
        ],
        "techstack": [
          "React",
          "Redux",
          "Bootstrap",
          "Node.js",
          "JavaScript (ES6+)",
          "TypeScript",
          "Jenkins"
        ]
      },
      {
        "title": "Full Stack Software Developer, ZeroWork GmbH (Startup, seed phase)",
        "tenure": "5/2022 - 8/2022",
        "description": "Drove the planning and development of ZeroWork’s marketplace and app, delivering a scalable no-code automation platform in a fast-paced, agile startup environment.",
        "tasks": [
          {
            "keyword": "Full Stack Development",
            "description": "Designed and integrated responsive frontend (React.js, Redux, Material UI, HTML5, CSS3) and backend (Python, Django, PostgreSQL) components and APIs, building a seamless marketplace and app ecosystem."
          },
          {
            "keyword": "Automation Core Development",
            "description": "Evaluated and implemented the product roadmap for the no-code automation core using Playwright, enabling robust app and marketplace functionality."
          },
          {
            "keyword": "Codebase Migration",
            "description": "Led the migration of the automation core from Python to TypeScript, enhancing performance and maintainability."
          },
          {
            "keyword": "Payment Integration",
            "description": "Integrated Stripe Payments across the app, marketplace, and backend, ensuring secure and efficient transaction processing."
          },
          {
            "keyword": "Scheduler Integration",
            "description": "Developed and integrated a remote scheduler using AWS and Redis, optimizing task automation for the platform."
          },
          {
            "keyword": "Release Ownership",
            "description": "Owned and executed the Mac release process, ensuring a smooth and timely product launch."
          },
          {
            "keyword": "Quality Assurance",
            "description": "Conducted code reviews and enforced Clean Code principles, improving code quality and reducing technical debt."
          }
        ],
        "techstack": [
          "React",
          "Next.js",
          "Redux",
          "Material UI",
          "Node.js",
          "Electron.js",
          "JavaScript (ES6+)",
          "TypeScript",
          "Python",
          "Docker",
          "AWS"
        ]
      },
      {
        "title": "Software Engineer, ZkSystems GmbH (Startup, seed phase)",
        "tenure": "4/2021 - 4/2022",
        "description": "Led the planning and development of the cross-platform app and automation core for the ZeroWork.io launch, delivering a scalable no-code automation platform in a dynamic, agile startup environment.",
        "tasks": [
          {
            "keyword": "Frontend Development",
            "description": "Designed and integrated responsive frontend components and APIs using React.js, Redux, Material UI, HTML5, and CSS3, enhancing user experience within an agile product team."
          },
          {
            "keyword": "Automation Core Development",
            "description": "Spearheaded the greenfield development of the no-code automation core using Python, Selenium, and an RPA framework, driving the product roadmap and enabling robust app functionality."
          },
          {
            "keyword": "Cross-Platform Development",
            "description": "Built the core product for cross-platform compatibility using Electron.js, Node.js, and Webpack, ensuring seamless performance across operating systems."
          },
          {
            "keyword": "Release Ownership",
            "description": "Owned and executed the Mac release process, delivering a successful product launch on schedule."
          },
          {
            "keyword": "Queue Management Integration",
            "description": "Developed and integrated on-premise and cloud-based queue management systems using AWS SQS, Redis, and Bull, optimizing workflow execution for the app and backend."
          },
          {
            "keyword": "Analytics & Logging",
            "description": "Implemented logging and user journey analytics across frontend and backend using AWS S3 and Mixpanel, enhancing product insights and performance tracking."
          },
          {
            "keyword": "Quality Assurance",
            "description": "Conducted code reviews and enforced Clean Code principles, improving code maintainability and reducing technical debt."
          },
          {
            "keyword": "Testing Infrastructure",
            "description": "Established unit testing frameworks with GitLab CI and Git, achieving over 50% test coverage and enhancing software reliability."
          },
          {
            "keyword": "Project Planning",
            "description": "Planned and validated the ZeroWork.io project, aligning technical development with strategic business goals."
          }
        ],
        "techstack": [
          "React",
          "Redux",
          "Material UI",
          "Node.js",
          "Electron.js",
          "JavaScript (ES6+)",
          "Python",
          "Selenium",
          "AWS"
        ]
      },
      {
        "title": "Web Developer, auteon GmbH (Startup, PoC phase)",
        "tenure": "7/2020 - 3/2021",
        "description": "Planned and developed auteon’s article comparison mechanism, leveraging browser automation and supplier APIs to create a robust, scalable platform in an agile, proof-of-concept startup environment.",
        "tasks": [
          {
            "keyword": "Backend Development",
            "description": "Designed and integrated software components and APIs for the backend, driving strategic and operational agile product development to support the article comparison core."
          },
          {
            "keyword": "System Optimization",
            "description": "Tested, maintained, and optimized existing components to enhance robustness, accuracy, and performance of the core product."
          },
          {
            "keyword": "Team Coordination",
            "description": "Mentored and supported three working students in the automation team, conducting code reviews to ensure high-quality deliverables."
          },
          {
            "keyword": "Codebase Modernization",
            "description": "Migrated monolithic legacy code to a modular automation core, applying Clean Code principles to improve maintainability and scalability."
          }
        ],
        "techstack": [
          "Vue",
          "Node.js",
          "Electron.js",
          "JavaScript (ES6+)",
          "TypeScript",
          "GraphQL",
          "Hasura",
          "PostgreSQL"
        ]
      },
      {
        "title": "Technical Account Manager, Hilti AG",
        "tenure": "11/2017 - 1/2020",
        "description": "Managed a portfolio of over 700 SME industrial clients in the Berlin area, driving consulting and direct sales to achieve strategic revenue and customer loyalty goals for a global leader in construction technology.",
        "tasks": [
          {
            "keyword": "Client Relationship Management",
            "description": "Built and nurtured long-term customer relationships, aligning with company targets while optimizing resource efficiency to enhance client satisfaction and retention."
          },
          {
            "keyword": "Technical Consulting & Workshops",
            "description": "Delivered compelling product presentations and technical workshops, leveraging Hilti’s systematic sales approach to provide tailored solutions and drive client adoption."
          },
          {
            "keyword": "Market Research & Strategy",
            "description": "Collaborated with leadership and technical teams to conduct qualitative and quantitative market research, identifying opportunities to strengthen market positioning and growth."
          },
          {
            "description": "Earned admission to Hilti’s Top Club Germany for two consecutive years, recognized by general management for surpassing strategic targets in customer loyalty, revenue growth, and execution of long-term growth initiatives."
          }
        ]
      }
    ]
  },
  "languagesData": {
    "label": "languagesdata",
    "data": [
      {
        "language": "German",
        "level": "native"
      },
      {
        "language": "English",
        "level": "C1"
      }
    ]
  },
  "personData": {
    "label": "persondata",
    "data": {
      "fullname": "Phillip Paul",
      "role": "Product Manager",
      "email": "phillip.paul@magenta.de",
      "emailsubject": "Hi Phillip!",
      "phone": "+49 176 3177 8623",
      "linkedin": "linkedin.com/in/phillippaul",
      "github": "github.com/ppauldev"
    }
  },
  "summaryData": {
    "label": "summarydata",
    "data": {
      "summary": "Generalist with a strong engineering foundation, passionate about delivering innovative software solutions in collaboration with high-performing teams. Committed to empowering mission-driven tech companies to achieve their strategic vision through pragmatic, detail-oriented, and business-focused leadership. Proven expertise in driving product excellence and aligning technical innovation with market needs."
    }
  }
}